clients = [
    {"ім’я": "Іван", "сума угоди": 50, "статус перевірки": "clean"},
    {"ім’я": "Оля", "сума угоди": 550, "статус перевірки": "suspicious"},
    {"ім’я": "Петро", "сума угоди": 2000, "статус перевірки": "fraud"},
    {"ім’я": "Марія", "сума угоди": "?", "статус перевірки": "clean"},
    {"ім’я": "Андрій", "сума угоди": 800, "статус перевірки": "unknown"}
]

result = []

for client in clients:
    імя = client["ім’я"]
    сума = client["сума угоди"]
    статус = client["статус перевірки"]

    if not isinstance(сума, (int, float)):
        категорія = "Фальшиві дані"
        рішення = "—"
    else:
        if сума < 100:
            категорія = "Дрібнота"
        elif сума < 1000:
            категорія = "Середнячок"
        else:
            категорія = "Великий клієнт"

        match статус:
            case "clean":
                рішення = "Працювати без питань"
            case "suspicious":
                рішення = "Перевірити документи"
            case "fraud":
                рішення = "У чорний список"
            case _:
                рішення = "Невідомий статус"

    result.append(f"{імя}: {категорія} → {рішення}")

for i in result:
    print(i)
