preparaty = [
    {"назва": "Амоксил", "кількість": 20, "категорія": "antibiotic", "температура": 22.5},
    {"назва": "Вітамін C", "кількість": 50, "категорія": "vitamin", "температура": 4.0},
    {"назва": "КовіВак", "кількість": 10, "категорія": "vaccine", "температура": 26.0},
    {"назва": "Ноотропіл", "кількість": "10", "категорія": "nootropic", "температура": 21.0},
    {"назва": "БАД", "кількість": 30, "категорія": "supplement", "температура": 19.0},
    {"назва": "Гепарин", "кількість": 15, "категорія": "antibiotic", "температура": 5.0},
]

for i in preparaty:
    name = i["назва"]
    quantity = i["кількість"]
    category = i["категорія"]
    temperature = i["температура"]

    if temperature < 5:
        temp = "Надто холодно"
    elif temperature > 25:
        temp = "Надто жарко"
    else:
        temp = "Норма"

    match category:
        case "antibiotic":
            categoryy = "Рецептурний препарат"
        case "vitamin":
            categoryy = "Вільний продаж"
        case "vaccine":
            categoryy = "Потребує спецзберігання"
        case _:
            categoryy = "Невідома категорія"

    print(f"Препарат: {name}, Категорія: {categoryy}, Температура: {temp}")
